timothybrown/TivaWare_GCC/cc3000/src/spi/spi-tm4c123.c
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);

    //
    // Enable the uDMA controller.
    //
    MAP_uDMAEnable();

    //
    //Configure the DMA channels for the selected SPI Module
    //
    MAP_uDMAChannelAssign( sSpiInformation.sHwSettings.ui32DMARxChannel);
    MAP_uDMAChannelAssign( sSpiInformation.sHwSettings.ui32DMATxChannel);

    //
    // Point at the control table to use for channel control structures
    //
    MAP_uDMAControlBaseSet(ui8DMAChannelControlStructure);

    //
    // Put the attributes in a known state for the uDMA SSIRX channel.  These
    // should already be disabled by default.
    //
    MAP_uDMAChannelAttributeDisable(sSpiInformation.sHwSettings.ui32DMARxChannel,
                                    UDMA_ATTR_ALTSELECT | UDMA_ATTR_USEBURST |
                                    UDMA_ATTR_HIGH_PRIORITY |
                                    UDMA_ATTR_REQMASK);

    //
    // Configure the control parameters for the primary control structure for
    // the SSI RX channel. The transfer data size is 8 bits, the source
    // address does not increment since it will be reading from a register.
    // The destination address increment is byte 8-bit bytes. The arbitration
    // size is set to 1 to match the RX FIFO trigger threshold. The uDMA
    // controller will use a 4 byte burst transfer if possible.
    //
    MAP_uDMAChannelControlSet((sSpiInformation.sHwSettings.ui32DMARxChannel |
                               UDMA_PRI_SELECT), (UDMA_SIZE_8 |
                              UDMA_SRC_INC_NONE | UDMA_DST_INC_8 | UDMA_ARB_1));

    //
    // Put the attributes in a known state for the uDMA SSITX channel.  These
    // should already be disabled by default.
    //
    MAP_uDMAChannelAttributeDisable(sSpiInformation.sHwSettings.ui32DMATxChannel,
                                    UDMA_ATTR_ALTSELECT | UDMA_ATTR_USEBURST |
                                    UDMA_ATTR_HIGH_PRIORITY |
                                    UDMA_ATTR_REQMASK);

    //
    // Configure the control parameters for the primary control structure for
    // the SSI RX channel. The transfer data size is 8 bits, the source
    // address does not increment since it will be reading from a register.
    // The destination address increment is byte 8-bit bytes. The arbitration
    // size is set to 1 to match the RX FIFO trigger threshold. The uDMA
    // controller will use a 4 byte burst transfer if possible.
    //
    MAP_uDMAChannelControlSet(sSpiInformation.sHwSettings.ui32DMATxChannel |
                              UDMA_PRI_SELECT, UDMA_SIZE_8 | UDMA_SRC_INC_8 |
                              UDMA_DST_INC_NONE | UDMA_ARB_4);

    //
    // Now both the uDMA SSI TX and RX channels are primed to start a
    // transfer.  As soon as the channels are enabled, the peripheral will
    // issue a transfer request and the data transfers will begin.
    //
    // The uDMA TX/RX channel must be disabled.
    //
    MAP_uDMAChannelDisable(sSpiInformation.sHwSettings.ui32DMARxChannel);
    MAP_uDMAChannelDisable(sSpiInformation.sHwSettings.ui32DMATxChannel);

    //
    // Enable the SSI interrupt
    //
    MAP_IntEnable(sSpiInformation.sHwSettings.ui32SsiPortInt);
}

//*****************************************************************************
//
// Close the SPI connection to the CC3000 by disabling all interrupts used in
// the communication.
//
//*****************************************************************************
void
SpiClose(void)
{
    if (sSpiInformation.pRxPacket)
    {
        sSpiInformation.pRxPacket = 0;
    }

    //
    //  Disable the interrupt from the IRQ GPIO input.
    //
    tSLInformation.WlanInterruptDisable();

    //
    // Disable interrupt for SPI IRQ and SSI module.
    //
    MAP_IntDisable(sSpiInformation.sHwSettings.ui32PortInt);
    MAP_IntDisable(sSpiInformation.sHwSettings.ui32SsiPortInt);
}

//*****************************************************************************
//
// Open the SPI driver.  Before calling this function, it is assumed that the
// SPI peripheral has been configured via a call to init_spi().  On exit,
// interrupts from SPI and the CC3000 IRQ GPIO pin are enabled.
//
//*****************************************************************************
void
SpiOpen(tSpiHandleRx pfnRxHandler)
{
    //
    // Parameter sanity check.
    //
    ASSERT(pfnRxHandler);

    //
    // Set the initial state to indicate that we need to wait for the power-up
    // handshake from the CC3000.
    //
    sSpiInformation.ui32SpiState = eSPI_STATE_POWERUP;

    //
    // Remember our receive callback handler function pointer.
    //
    sSpiInformation.SPIRxHandler = pfnRxHandler;

    //
    // Initialize buffer-related fields.
    //
    sSpiInformation.ui16TxPacketLength = 0;
    sSpiInformation.pTxPacket = NULL;
    sSpiInformation.pRxPacket = wlan_rx_buffer;
    sSpiInformation.ui16RxPacketLength = 0;
    sSpiInformation.ulRxBufferSize = CC3000_RX_BUFFER_SIZE;

    //
    // Enable the interrupt from the CC3000 IRQ.
    //
    tSLInformation.WlanInterruptEnable();

    //
    // Enable the IRQ and SPI interrupts in the NVIC.
    //
    MAP_IntEnable(sSpiInformation.sHwSettings.ui32PortInt);
    MAP_IntEnable(sSpiInformation.sHwSettings.ui32SsiPortInt);
}

//*****************************************************************************
//
// Configure the SPI peripheral to use the frequency specified in ui32SSIFreq
// and set up pin muxing as required for the SPI signals and CC3000 IRQ GPIO.
//
//*****************************************************************************
int init_spi(uint32_t ui32SSIFreq, uint32_t ui32SysClck)
{
    //
    // Configure the hardware to use the required SPI and GPIO peripherals.
    //
    SpiConfigureHwMapping();

    //
    // Set SPI interface configuration parameters.
    //
    SSIConfigure(ui32SSIFreq, ui32SysClck);

    return(ESUCCESS);
}

//*****************************************************************************
//
// Returns the transfer mode of the specified DNA channel.  This will be
// one of UDMA_MODE_STOP if the channel is stopped or UDMA_MODE_BASIC if a
// transfer is ongoing on the channel.
//
//*****************************************************************************
static uint32_t
SpiCheckDMAStatus(uint32_t ui32Channel)
{
    uint32_t ui32Chan;

    //
    // Check the DMA control table to see if the basic transfer is
    // complete.  The basic transfer uses receive buffer g_ui8InBuffer,
    // and the primary control structure.
    //
    ui32Chan = (ui32Channel == sSpiInformation.sHwSettings.ui32DMATxChannel) ?
             (sSpiInformation.sHwSettings.ui32DMATxChannel | UDMA_PRI_SELECT) :
             (sSpiInformation.sHwSettings.ui32DMARxChannel | UDMA_PRI_SELECT);

