timothybrown/TivaWare_GCC/cc3000/src/spi/spi-tm4c123.c
    MAP_uDMAChannelTransferSet((sSpiInformation.sHwSettings.ui32DMARxChannel |
                               UDMA_PRI_SELECT), UDMA_MODE_BASIC,
                               (void *)(sSpiInformation.sHwSettings.ui32SsiPort +
                                        SSI_O_DR),
                               (void *)pui8Data, ui16Size);

    //
    // Clean out any stale data that may be in the SSI receive FIFO.
    //
    SpiFlushRxFifo();
    MAP_SSIDMAEnable(sSpiInformation.sHwSettings.ui32SsiPort,
                     SSI_DMA_TX | SSI_DMA_RX);

    //
    // Enable both the RX and TX channels here.  The transmit is also needed
    // here to ensure that the master (us) generates the clocks required to
    // read the required data from the slave.
    //
    SpiEnableSSIDMAChannels();
}

//*****************************************************************************
//
// Schedule a single SPI transmit DMA transaction (which requires a partner
// receive transaction to keep the receive FIFO flushed).  If the size passed
// is larger than can be handled in a single DMA transaction, the transaction
// is split into pieces and the first piece is scheduled here.
//
// This function is asynchronous and returns immediately the DMA transactions
// have been enabled.  It does not block until the transmit has completed.
// Completion of a transaction is indicated via the SSI uDMA interrupt and
// the driver state machine handles scheduling further pieces of a multi-
// transfer write.
//
//*****************************************************************************
static void
SpiWriteAsync(const uint8_t *pui8Data, uint16_t ui16Size)
{
    //
    // The uDMA channels must be disabled.
    //
    SpiDisableSSIDMAChannels();

    //
    // The uDMA controller can only transfer 1024 bytes in a single transaction
    // when using basic mode.  If asked for more than 1024 bytes, we split the
    // transaction into two.
    //
    if (ui16Size <= SPI_WINDOW_SIZE)
    {
        //
        // We can handle this request in a single DMA transaction.
        //
        sSpiInformation.ui32SpiState = eSPI_STATE_WRITE_EOT;
    }
    else
    {
        //
        // Remember that we've split this into two DMA transactions and set
        // up to send the first part.
        //
        sSpiInformation.ui32SpiState = eSPI_STATE_WRITE_FIRST_PORTION;

        //
        // Truncate the packet to the maximum size for now.
        //
        ui16Size = SPI_WINDOW_SIZE;
    }

    //
    // Set up a dummy RX DMA to keep the receive FIFO flushed.
    //
    MAP_uDMAChannelControlSet(sSpiInformation.sHwSettings.ui32DMARxChannel |
                              UDMA_PRI_SELECT, UDMA_SIZE_8 | UDMA_SRC_INC_NONE |
                              UDMA_DST_INC_NONE | UDMA_ARB_1);
    MAP_uDMAChannelTransferSet(
              (sSpiInformation.sHwSettings.ui32DMARxChannel |
               UDMA_PRI_SELECT), UDMA_MODE_BASIC,
              (void *)(sSpiInformation.sHwSettings.ui32SsiPort + SSI_O_DR),
              (void *)g_pui8Dummy, ui16Size );

    //
    // Start another DMA transfer to SSI TX.
    //
    MAP_uDMAChannelControlSet(sSpiInformation.sHwSettings.ui32DMATxChannel |
                              UDMA_PRI_SELECT, UDMA_SIZE_8 | UDMA_SRC_INC_8 |
                              UDMA_DST_INC_NONE | UDMA_ARB_4);

    MAP_uDMAChannelTransferSet(
              (sSpiInformation.sHwSettings.ui32DMATxChannel|UDMA_PRI_SELECT),
              UDMA_MODE_BASIC,(void *)pui8Data,
              (void *)(sSpiInformation.sHwSettings.ui32SsiPort + SSI_O_DR),
              ui16Size );

    //
    // Enable the SSI transmit and receive DMA channels.
    //
    MAP_SSIDMAEnable(sSpiInformation.sHwSettings.ui32SsiPort,
                     SSI_DMA_TX | SSI_DMA_RX);
    SpiEnableSSIDMAChannels();
}

//*****************************************************************************
//
// This function, used during early initialization of the CC3000,  transmits a
// single packet via SPI and waits for the transmission to complete.  It is
// assumed that the packet to be transmitted is 1024 bytes or less in size and
// can be accommodated in a single DMA transaction.  On completion, the SSI
// EOT (used during normal operation to signal completion of a transmission)
// interrupt is left enabled.
//
//*****************************************************************************
static void
SpiWriteDataSynchronous(const uint8_t *pui8Data, uint16_t ui16Size)
{
    //
    // This is a synchronous, polled write so we disable all SSI-related
    // interrupts.
    //
    MAP_IntDisable(sSpiInformation.sHwSettings.ui32SsiPortInt);

    //
    // Perform the write.
    //
    SpiWriteAsync(pui8Data, ui16Size);

    //
    // Wait for the DMA transmit transaction to complete.
    //
    while(SSIBusy(SPI_BASE))
    {
        //
        // Kill time.
        //
    }

    //
    // Clear pending SSI DMA interrupts in the NVIC.
    //
    IntPendClear(INT_SPI);
    IntPendClear(INT_UDMA);

    //
    // Re-enable the SSI interrupt.
    //
    MAP_IntEnable(sSpiInformation.sHwSettings.ui32SsiPortInt);
}

//*****************************************************************************
//
// This function is called to start reception of data from the CC3000.  It
// schedules reception of 10 bytes from the device.  This contains the packet
// header and 5 bytes of payload data which is sufficient to determine the
// type of packet being received and the length of the remaining payload data.
//
// The function schedules reception and enables the DMA transactions then
// returns immediately.  Reception of the remainder of the packet is handled
// in the SPI interrupt handler when the header reception completes.
//
//*****************************************************************************
void
SpiReadHeader(void)
{
    sSpiInformation.ui32SpiState = eSPI_STATE_READ_IRQ;

    SpiReadData(sSpiInformation.pRxPacket, 10);
}

//*****************************************************************************
//
// Parse a previously-received packet header and, based on the content,
// schedule a further DMA transaction to receive the remainder of the bytes
// that the CC3000 is sending.  This function is called when the DMA
// transaction initiated by SpiReadHeader() completes.
//
// This function returns the number of bytes that are scheduled to be received
// in the next DMA transaction.  Note that, if the packet payload is larger
// than can be accommodated in a single DMA transaction, this value may be
// less than the payload size.
//
// It is assumed that the receive buffer at sSpiInformation.pRxPacket contains
// the first 10 bytes of an incoming packet before this function is called.
// These 10 bytes contain the SPI packet header and the HCI header.
//
// In cases where the received header contains a payload length larger than the
// available receive buffer size, the function does not schedule another DMA
// transaction but returns 0 and sets *pbError to true to indicate a problem.
//
//*****************************************************************************
long
SpiReadDataCont(bool *pbError)
{

    uint32_t ui32Count;
    uint8_t *pui8Buff;
    uint8_t ui8Type;
    //
    // Parameter sanity check.
    //
    ASSERT(pbError);

    //
    // Assume no error until we determine otherwise.
    //
    *pbError = false;

    //
    // Determine what type of packet we have
    //
    pui8Buff =  sSpiInformation.pRxPacket;
    ui32Count = 0;
    STREAM_TO_UINT8((char *)(pui8Buff + SPI_HEADER_SIZE),
                    HCI_PACKET_TYPE_OFFSET, ui8Type);

    //
    // What type of packet have we received?
    //
    switch(ui8Type)
    {
        //
        // The packet header indicates that this is a data packet.
        //
        case HCI_TYPE_DATA:
        {
            //
            // Determine the length of the data packet payload.  For a data
            // packet, the length is two bytes long allowing payloads of up
            // to 65535 bytes (although this implementation doesn't use
            // packets that long).
            //
            STREAM_TO_UINT16((char *)(pui8Buff + SPI_HEADER_SIZE),
                             HCI_DATA_LENGTH_OFFSET, ui32Count);

            //
            // Is this payload too long to be received into the buffer that
            // we have available to us?  If so, this indicates a software
            // error or a corruption in the received packet.  Either way, we
            // don't bother trying to receive the reset of the packet.  Note
            // that we need to round the packet size to the nearest higher
            // multiple of two because we've not considered padding yet.
            //
            if(((ui32Count + HCI_DATA_HEADER_SIZE +
                 SPI_HEADER_SIZE + 1) & ~1) >
               sSpiInformation.ulRxBufferSize)
            {
                //
                // This must be a corrupted packet because the length we parsed
                // out of the header is larger than our receive buffer.
                //
                *pbError = true;
                return(0);
            }

            //
            // Can we get the whole payload in a single DMA transaction?
            //
            if (ui32Count >= SPI_WINDOW_SIZE)
            {
                //
                // No - receive as much as we can in the next transaction.
                //
                SpiReadData(pui8Buff + 10, SPI_WINDOW_SIZE);
                sSpiInformation.ui32SpiState = eSPI_STATE_READ_FIRST_PORTION;
            }
            else
            {
                //
                // Yes - the amount we have to read is strictly less than the
                // maximum DMA transaction size so we can read the whole
                // payload in one transaction, even if we need an additional
                // padding byte.
                //
                // Do we need that padding byte? Note that the payload length
                // is 2 bytes in a data packet but only one in an event packet
                // so the length we need to read is actually the length parsed
                // from the packet - we haven't already read the first payload
                // byte as we have in the (following) event case.  We've
                // already read 10 bytes so, to keep the whole packet an even
                // number of bytes, we need to read an even number of payload
                // bytes.
                //
                if (!((HEADERS_SIZE_EVNT + ui32Count) & 1))
                {
                    ui32Count++;
                }

                if (ui32Count)
                {
                    SpiReadData(pui8Buff + 10, ui32Count);
                }

                sSpiInformation.ui32SpiState = eSPI_STATE_READ_EOT;
            }
            break;
        }

        //
        // The packet header indicates that this is an event packet.
        //
        case HCI_TYPE_EVNT:
        {
            //
            // Determine the length of the event packet payload.  This is a
            // single byte in the event packet header.
            //
            STREAM_TO_UINT8((char *)(pui8Buff + SPI_HEADER_SIZE),
                            HCI_EVENT_LENGTH_OFFSET, ui32Count);

            //
            // Subtract one because we already read the first payload byte (or
            // a padding byte) when we read the initial 10 bytes.
            //
            ui32Count -= 1;

            //
            // Add a padding byte if needed.  All packets contain an even
            // number of bytes.
            //
            if ((HEADERS_SIZE_EVNT + ui32Count) & 1)
            {
                ui32Count++;
            }

            //
            // Is this payload too long to be received into the buffer that
            // we have available to us?  If so, this indicates a software
            // error or corruption in the received header.  Either way, we
            // don't bother trying to receive the reset of the packet.
            //
            if((ui32Count + HEADERS_SIZE_EVNT) >
               sSpiInformation.ulRxBufferSize)
            {
                //
                // This must be a corrupted packet because the length we parsed
                // out of the header is larger than our receive buffer.
                //
                *pbError = true;
                return(0);
            }

            //
            // If there is any more data to receive, schedule another DMA
            // transaction.
            //
            if(ui32Count)
            {
                SpiReadData(pui8Buff + 10, ui32Count);
            }

            sSpiInformation.ui32SpiState = eSPI_STATE_READ_EOT;
            break;
        }

        //
        // The packet type is unrecognized so don't receive anything more.
        //
        default:
        {
            *pbError = true;
            return(0);
        }
    }

    //
    // If we get here, we've scheduled a new DMA transaction to read the
    // remainder of the packet.  Tell the caller how many bytes they should
    // expect when that transaction completes.
    //
    return (ui32Count);
}

//*****************************************************************************
//
// Disable all interrupts associated with the SPI interface and the IRQ line.
//
//*****************************************************************************
static void
SpiDisableInterrupts(void)
{
    MAP_IntDisable(sSpiInformation.sHwSettings.ui32SsiPortInt);
    MAP_IntDisable(sSpiInformation.sHwSettings.ui32PortInt);
}

//*****************************************************************************
//
// Re-enable the interrupts associated with the SPI interface and IRQ line.
//
//*****************************************************************************
void
SpiResumeSpi(void)
{
    MAP_IntEnable(sSpiInformation.sHwSettings.ui32SsiPortInt);
    MAP_IntEnable(sSpiInformation.sHwSettings.ui32PortInt);
}

//*****************************************************************************
//
// A packet has been received.  Clean up, deasserting CS after the last bit has
// cleared the transmitter (remember, we need to transmit dummy data during
// receipt of a packet because we're the master and, hence, drive the SPI
// clock), then, if the packet isn't marked as bad, pass it up the stack for
// further processing.
//
//*****************************************************************************
void
SpiTriggerRxProcessing(bool bBadPacket)
{
    //
    // Tidy up at the end of receiving a packet.
    //
    SpiDisableInterrupts();
    while(SSIBusy(SPI_BASE));
    DEASSERT_CS();

    //
    // Turn off SSI receive DMA now that the transfer is complete.
    //
    MAP_SSIDMADisable(sSpiInformation.sHwSettings.ui32SsiPort, SSI_DMA_RX);

    //
    // Move back to idle state so that we are ready to send or receive another
    // packet.
    //
    sSpiInformation.ui32SpiState = eSPI_STATE_IDLE;

    //
    // If this packet isn't marked as bad, pass it up the stack for processing.
    //
    if(!bBadPacket)
    {
        sSpiInformation.SPIRxHandler(sSpiInformation.pRxPacket +
                                     SPI_HEADER_SIZE);
    }
}

//*****************************************************************************
//
// This function is called whenever a SPI DMA transaction completes during
// reception of a packet from the CC3000.  It schedules the next DMA
// transaction if one is required to receive additional packet data then, once
// no more data is to be read, passes the completed packet for processing via
// SpiTriggerRxProcessing().
//
//*****************************************************************************
static void
SpiContReadOperation(void)
{
    bool bError;

    //
    // Parse the header we already received then receive the remainder of the
    // packet.  This function returns 0 when the packet is complete or when
    // reception is aborted due to a packet error.  In cases of bad packets,
    // bError will be "true", otherwise it will be "false".
    //
    if (!SpiReadDataCont(&bError))
    {
        //
        // The packet was received successfully so pass it up the stack
        // for processing.
        //
        SpiTriggerRxProcessing(bError);
    }
}

//*****************************************************************************
//
// The interrupt handler for the GPIO input which is connected to the CC3000
// IRQ signal.  This line is used to signal asynchronous reception of data
// from the CC3000 or as a handshake for the CS line when sending commands to
// the CC3000.
//
// When the IRQ is asserted (pulled low) with CS high, this indicates that the
// CC3000 has information that we must read.  We assert CS and start the packet
// read here.
//
// When a command is being sent to the CC3000, we assert CS (with IRQ still
// high) then the CC3000 handshakes this by pulling IRQ low.  When we detect
// this transition, we start transmission of the command packet.
//
//*****************************************************************************
void
IntSpiGPIOHandler(void)
{
    uint32_t ui32Status;

    //
    // Which pin caused the interrupt?
    //
    ui32Status = SpiCleanGPIOISR();

    //
    // Was it our IRQ pin?
    //
    if(ui32Status & SPI_IRQ_PIN)
    {
        //
        // Yes - is this the first IRQ interrupt since powering up?
        //
        if (sSpiInformation.ui32SpiState == eSPI_STATE_POWERUP)
        {
            //
            // We received the first IRQ line edge after powering up the
            // part.  This is part of the startup sequence so change the state
            // to show that we received this.
            //
            sSpiInformation.ui32SpiState = eSPI_STATE_INITIALIZED;
        }
        else if (sSpiInformation.ui32SpiState == eSPI_STATE_IDLE)
        {
            //
            // We're idle so an IRQ interrupt indicates that the CC3000 has
            // data to send us.
            //
            sSpiInformation.ui32SpiState = eSPI_STATE_READ_IRQ;

            //
            // IRQ line asserted so handshake with CS and set up to
            // receive a packet header from the CC3000.
            //
            ASSERT_CS();

            //
            // Start receiving the 10 byte header from the CC3000.
            //
            SpiReadHeader();
        }
        else if (sSpiInformation.ui32SpiState == eSPI_STATE_WRITE_IRQ)
        {
            //
            // The CC3000 has responded to us lowering CS by handshaking with
            // its IRQ.  This indicates that we can now start transmitting the
            // command packet that we're waiting to send.
            //
            SpiWriteAsync(sSpiInformation.pTxPacket,
                          sSpiInformation.ui16TxPacketLength);
        }
    }
}

//*****************************************************************************
//
// The SPI peripheral interrupt handler.  This is called whenever a transmit
// or receive DMA transaction involving the SPI peripheral completes.  Note
// that, on TM4C123 parts, DMA completion is signalled using the peripheral
// interrupt but the peripheral interrupt status register is not involved and
// does not contain status bits indicating DMA interrupts.
//
//*****************************************************************************
void
SpiIntHandler(void)
{
    bool bTxFinished, bRxFinished;
    uint16_t ui16Count;
    uint8_t *pui8Buff;

    //
    // Determine which of the DMA transactions are now complete.
    //
    bTxFinished = SpiIsDMAStopped(sSpiInformation.sHwSettings.ui32DMATxChannel);
    bRxFinished = SpiIsDMAStopped(sSpiInformation.sHwSettings.ui32DMARxChannel);

    pui8Buff =  sSpiInformation.pRxPacket;
    ui16Count = 0;

    if (sSpiInformation.ui32SpiState == eSPI_STATE_READ_IRQ)
    {
        //
        // If both DMA transactions have completed...
        //
        if (bTxFinished && bRxFinished)
        {
            //
            // Clear any pending SSI interrupt which can be caused by the other
            // DMA transaction completing.
            //
            IntPendClear(sSpiInformation.sHwSettings.ui32SsiPortInt);

            //
            // Parse the packet header data received and receive the remainder
            // of the response.
            //
            SpiContReadOperation();
        }
    }
    //
    // Have we just read the first portion of a packet that is too long for
    // a single DMA transaction and which has to be split into one or more
    // sections?
    //
    else if (sSpiInformation.ui32SpiState == eSPI_STATE_READ_FIRST_PORTION)
    {
        //
        // Did the receive DMA transaction complete?
        //
        if (bRxFinished)
        {
            //
            // Clean up any additional interrupts pending at the NVIC.
            //
            IntPendClear(sSpiInformation.sHwSettings.ui32SsiPortInt);

            //
            // Get the size of the packet payload from the header.  We assume
            // that this must be a data packet because an event packet cannot
            // have a payload longer than 255 bytes and, therefore, can always
            // be accommodated in a single DMA transaction.
            //
            STREAM_TO_UINT16((char *)(pui8Buff + SPI_HEADER_SIZE),
                              HCI_DATA_LENGTH_OFFSET, ui16Count);

            //
            // We have already read one maximum-DMA-sized chunk of the data
            // so subtract this from the payload length to get the number of
            // bytes we still need to read.
            //
            ui16Count -=SPI_WINDOW_SIZE;

            //
            // Pad the count of bytes to receive so that the incoming packet
            // always contains an odd number of bytes.
            //
            if (!((HEADERS_SIZE_EVNT + ui16Count) & 1))
            {
                ui16Count++;
            }

            //
            // Schedule a new DMA transaction to receive the remaining bytes
            // in the packet.  The assumption here is that no packet can be
            // longer than (10 + (2* SPI_WINDOW_SIZE)) bytes.
            //
            SpiReadData(sSpiInformation.pRxPacket + 10 + SPI_WINDOW_SIZE,
                        ui16Count);

            //
            // Remember that we're waiting for the last portion of the packet
            // to be read.
            //
            sSpiInformation.ui32SpiState = eSPI_STATE_READ_EOT;
        }
    }
    //
    // Were we waiting for the last part of a received packet to arrive?
    //
    else if (sSpiInformation.ui32SpiState == eSPI_STATE_READ_EOT)
    {
        //
        // Did the receive DMA complete?
        //
        if (bRxFinished)
        {
            //
            // Yes - clean up any SSI interrupt that may be pending at the NVIC.
            //
            IntPendClear(sSpiInformation.sHwSettings.ui32SsiPortInt);

            //
            // Process the received packet.
            //
            SpiTriggerRxProcessing(false);
        }
    }
    //
    // Were we waiting for the last part of a transmitted packet to be sent?
    //
    else if (sSpiInformation.ui32SpiState == eSPI_STATE_WRITE_EOT)
    {
        //
        // Did the transmit DMA complete?
        //
        if (bTxFinished)
        {
            //
            // Wait for the last bit of the transmission to make it onto the
            // wire.
            //
            while(SSIBusy(SPI_BASE));

            //
            // Raise CS to indicate that the packet has ended.
            //
            DEASSERT_CS();

            //
            // Clean out any stray data that may exit in the receive FIFO.
            //
            SpiFlushRxFifo();

            //
            // We're finished with this transaction so go back to idle.
            //
            sSpiInformation.ui32SpiState = eSPI_STATE_IDLE;
        }
    }
    //
    // Have we just sent the first part of a large transmit packet?
    //
    else if (sSpiInformation.ui32SpiState == eSPI_STATE_WRITE_FIRST_PORTION)
    {
        //
        // Are we being notified that the transmit DMA completed?
        //
        if (bTxFinished)
        {
            //
            // Yes - send the remainder of the packet.  The assumption, again,
            // is that no packet can be more than (10 + (2 * SPI_WINDOW_SIZE))
            // bytes long.
            //
            SpiFlushRxFifo();

            sSpiInformation.ui32SpiState = eSPI_STATE_WRITE_EOT;

            SpiWriteAsync(sSpiInformation.pTxPacket + SPI_WINDOW_SIZE,
                          sSpiInformation.ui16TxPacketLength - SPI_WINDOW_SIZE);
        }
    }
}
